---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceDoesNotCutMeshFace
source: html/66203ee7-0f4d-a05f-553f-88e27feaf87d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceDoesNotCutMeshFace Property

The surface-based splitter does not intersect a face to be divided and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCuttingSurfaceDoesNotCutMeshFace { get; }
```